OpenFOAM-13/tutorials/multicomponentFluid/simplifiedSiwek/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 37.5;

boundaryField
{
    top
    {
        type            kqRWallFunction;
        value           uniform 37.5;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 37.5;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 37.5;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
